answer = input('Какой язык программирования мы изучаем?')
if answer == 'Python':
    print('Верно! Мы ботаем Python =)')
    print('Python - отличный язык!')
else:
    print('Не совсем так!')
# Оператор присваивания (=) присваивает переменным значения:
# num = 1992
# s = 'I love Python'

# Для проверки двух элементов на равенство Python использует оператор сравнения (==). Вот так:
# if answer == 'Python':
# if name == 'Gvido':
# if temperature == 40:

# if x > 7	если x больше 7
# if x < 7	если x меньше 7
# if x >= 7	если x больше либо равен  7
# if x <= 7	если x меньше либо равен  7
# if x == 7	если x равен  7
# if x != 7	если x не равен  7

