print(2 ** 0)
print(2 ** 1)
print(2 ** 2)
print(2 ** 3)
print(2 ** (-1))
print(2 ** 2 ** 3)  # 2 ** (2 ** 3) = 2 ** 8
# Возведение в степень. Значение выражения вычисляется справа налево

print(10 // 3)  # 3
print(10 // 4)  # 2
print(10 // 5)  # 2
print(10 // 6)  # 1
print(10 // 12)  # 0
print(-10 // 3)  # -4
print(-13 // 3)  # -5
print(-12 // 3)  # -4
# Целочисленное деление. Выводит целые числа, без остатка

print(10 % 3)  # 1
print(10 % 4)  # 2
print(10 % 5)  # 0
print(10 % 6)  # 4
print(10 % 12)  # 10
print(10 % 20)  # 10
# Деление с остатком. Выводит только остаток
